import React from 'react';
import './Blog.css';
const Blog = () => {
    return (
        <div>
            <h1 className='context-api'>What is Context api?</h1>
            <h3> রিয়েক্ট অ্যাপ্লিকেশনে একটা parent কম্পোনেন্টের ডাটা children component এ দেখানোর জন্য data কে props হিসাবে পাঠাতে হয় । কিন্তু কিছু কিছু ক্ষেত্রে parentর ডাটাকে এর বিভিন্ন স্তরের children কে দেখানোর দরকার হতে পারে । এইটা আমরা props drill এর মাধ্যমে করতে পারি কিন্তু এই ক্ষেত্রে প্রপস ড্রিলিং কোন ভালো উপায় না। এই ধরনের সমস্যা আমরা solve করতে পারি context apiএর মাধ্যমে ।কন্টেক্সট আমাদের parent ar সবগুলো চিলড্রেন বা componetn tree এর ভিতর ডাটা সেন্ড করার সুযোগ করে দেয় manualy props send করা ছাড়ই।</h3><br></br>
            <h1 className='semantic-element'>What are Semantic Elements?</h1>
            <h2>
                সিমেন্টিক এলিমেন্ট এক ধরনের ট্যাগ । যার সাহায্যে ব্রাউজার কে ক্লিয়ার ভাবে বোঝানো সম্ভব যে এই এলিমেন্ট টা কিসের জন্য ব্যবহার করা হয়েছে এবং এটার কাজ কি। যেমন আমরা যদি একটা উদাহরণ দেখি । আমরা একটা নেভিগেশন বার তৈরি করতে চাচ্ছি । নেভিগেশন বারের ভেতরে অনেকগুলা item থাকতে পারে তো আমাদের সেই আইটেমগুলো রাখার জন্য একটা কন্টেইনার দরকার | তো আমরা জানি div একটা এলিমেন্ট যা দ্বারা একটা কন্টেইনার বোঝানো হয় | তো আমরা ইচ্ছা করলে item গুলাকে div এর ভিতরে রাখতে পারি । কিন্তু nav item গুলো তো একটা সাধারন item না এটা একটা স্পেশাল এবং ইউনিট item । আমরা যদি navItem গুলোকে একটা div এর ভিতর রাখি তাহলে ব্রাউজার এটাকে স্পেশাল item হিসেবে বুঝবে না সে এটাকে সাধারণ এলিমেন্ট হিসেবে ধরে নেবে | কিন্তু এইখানে যদি আমরা একটা সিমেন্টিক এলিমেন্ট nav এর ভিতর navItem গুলোকে রাখি তখন ব্রাউজার বুঝবে এইটা একটা স্পেশাল ইউনিক এলেমেন্ট বা nav item । এক্ষেত্রে ব্রাউজারের সার্চ এর উপর base করে রেজাল্ট দেখানো সহজ হয় ।
            </h2>
        </div>

    );
};

export default Blog;